API-rep/Open-Node-RC-Core/lib/ESP32_PWM_Motor/ESP32_PWM_Motor.cpp
#include "ESP32_PWM_Motor.h"

#include "Arduino.h"

// #include "esp32-hal.h"
// #include "soc/soc_caps.h"
#include "driver/ledc.h"

ledc_timer_config_t *ESP32_PWM_Motor::_timers_config[] = {NULL};	// init timers config pointers
uint8_t	ESP32_PWM_Motor::_clients_for_timer[] = {0};				// init timers clients channels counter
int8_t	ESP32_PWM_Motor::_default_timer = NOT_SET;
bool	ESP32_PWM_Motor::_pwm_channel_used[] = {0};				    // init channels usage log array

int		ESP32_PWM_Motor::_logHasOccure = NOT_SET;					// init espErr char counter attribute

/////////////////////////////////////////////////////////////////////////////////////
/*	ESP32_PWM_Motor constructor - build an instance of the class
/		Initalize motor contoller and default (safe) atributes values              */
/////////////////////////////////////////////////////////////////////////////////////
ESP32_PWM_Motor::ESP32_PWM_Motor()
{
	_dirPin			   = NOT_SET;
	_breakPin		   = NOT_SET;
	_breakPinMode	 = NOT_SET;
	_sleepPin		   = NOT_SET;
	_sleepPinMode	 = NOT_SET;
	
	_pwmTimer		   = NOT_SET;
	_pwmChannel		 = NOT_SET;
	_pwmMaxDuty		 = NOT_SET;

	_dirMode       = NOT_SET;

	_minMargin		 = MIN_SPEED;
	_maxMargin		 = MAX_SPEED;
	_marginAreSet	 = false;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	useTimer(timer) - set a specific timer for PWM signal before attach()
/		uint8_t timer: ledc high speed timer to use (0-3)
/	NOTE: Can be used once and before attach() (will be ignore otherwise)           
/         Timer of another motor can be use. Use thisMotor.getPwmTimer() to get it */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::useTimer(int8_t timer)
{
	if ((timer < LEDC_TIMER_MAX) && (_pwmTimer == NOT_SET)) {
		_pwmTimer = timer;
		return EXIT_SUCCESS;
	}
	
	return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	useChannel(channel) - set a specific channel for PWM signal before attach()
/		uint8_t channel: ledc high speed channel to use (0-7)
/	NOTE: Can be used once and before attach() (will be ignore otherwise)           
/         Usefull to force PWM channel to use if a conflict is meet                */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::useChannel(int8_t channel)
{
	if ((channel < LEDC_CHANNEL_MAX) && (_pwmChannel == NOT_SET)) {
		_pwmChannel = channel;
		
		return EXIT_SUCCESS;
	}
	
	return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	attach(pwmPin, dirPin, pwmFreq) - setup motor controller pins and PWM signal
/		uint8_t pwmPin: pin connected to motor driver PWM input
/		uint8_t dirPin: pin connected to motor driver direction pin
/		uint32_t pwmFreq: frequency of PWM output (= DEF_PWM_FREQ if not set)      */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::attach(uint8_t pwmPin, int8_t dirPin, uint32_t pwmFreq)									
{																												DPRINTLN("Setting up PWM signal generator ...");
		// setup PWM timer if not previously configured before attach()
	if (_pwmTimer == NOT_SET) {																					DPRINTLN("  - PWM timer selection :");
			// use default timer if no pwmFreq is provided and if default timer is already defined ...
		if ((pwmFreq == 0) && (_default_timer != NOT_SET)) {													DPRINT("    -> No specific PWM frequency provided. Using previously configured timer "); DPRINT(_default_timer); DPRINTLN(" as default timer.");
			_pwmTimer = _default_timer;
		}
			// ... or select a free PWM timer if available.
		else {																									DPRINTLN("    -> Testing available timer");
			for (uint8_t timer = 0; timer <= LEDC_TIMER_MAX; timer++)
			{		// use first free timer ...
				if (_clients_for_timer[timer] == 0) {															DPRINT("    -> Timer "); DPRINT(timer); DPRINTLN(" free. Using it for PWM signal.");
					_pwmTimer = timer;
					
					break;
				}
					// ... or exit with error if no one are available
				if (timer == (LEDC_TIMER_MAX - 1)) {															DPRINTLN("    -> No suitable free timer available. Abording configuration.");
					return EXIT_FAILURE;
				}
			}
			
				// define default pwm_timer if not already set
			if (_default_timer == NOT_SET) {
					// set PWM frequency to default value if not provided
				if (!pwmFreq) {																					DPRINTLN("    -> No frequency provided to configure timer. Using default value.");
					pwmFreq = DEF_PWM_FREQ;
				}
					// set this timer as default timer
				_default_timer = _pwmTimer;																		DPRINT("    -> Using this timer as default timer with "); DPRINT(pwmFreq); DPRINTLN(" Hz base frequency.");
			}
		}
		
			// create PWM timer config structure if not yet set
		if (_timers_config[_pwmTimer] == NULL) {																DPRINT("  - Setting up timer "); DPRINT(_pwmTimer); DPRINTLN(" configuration.");
			_timers_config[_pwmTimer] = new ledc_timer_config_t;				// create timer config structure
			
				// seeding timer config parameters 
			_timers_config[_pwmTimer]->speed_mode	= LEDC_HIGH_SPEED_MODE;		// set timer mode
			_timers_config[_pwmTimer]->freq_hz		= pwmFreq;					// set frequency of PWM signal
			_timers_config[_pwmTimer]->timer_num	= (ledc_timer_t)_pwmTimer;	// set timer index
			_timers_config[_pwmTimer]->clk_cfg		= LEDC_AUTO_CLK;			// set LEDC source clock

				// find max PWM resolution for pwmFreq
			uint8_t resBit = LEDC_TIMER_BIT_MAX;								// max PWM resolution in bit

				// redirect esp log to silent log function
			esp_log_set_vprintf(&ESP32_PWM_Motor::espSilentLog);
																												DPRINTLN("    -> Computing PWM maximum bit resolution for frequency.");
 			while ((resBit > 0) && (_logHasOccure != 0)) {
					// reset silent log flag tracker
				_logHasOccure = false;

					// test timer with current resBit
				_timers_config[_pwmTimer]->duty_resolution = (ledc_timer_bit_t)resBit;	// write resolution in timer config
				ledc_timer_config(_timers_config[_pwmTimer]);							// try to start timer with current config. Return write to char_in_esp_error_log.
  
