API-rep/Open-Node-RC-Core/lib/ESP32_PWM_Motor/ESP32_PWM_Motor.cpp
				resBit--;
			}
																												DPRINT("    -> Resolution of "); DPRINT(_timers_config[_pwmTimer]->duty_resolution); DPRINTLN(" bits found");
				// reset silent log flag and restore esp log output tu UART0
			_logHasOccure = NOT_SET;
			esp_log_set_vprintf(&vprintf);

			if (resBit <= 0) {																					DPRINTLN("    -> Unexpected error durring PWM timer config. Abording configuration.");
					// free up memory and exit
				delete _timers_config[_pwmTimer];
				
				return EXIT_FAILURE;
			}
		}
	}
	else {																										DPRINT("  - PWM timer specified by user. Using timer ");DPRINT(_pwmTimer); DPRINTLN(" for PWM signal");
		// pwm timer set prior attach(). Statement for debug output.
	}
	
	
		// create PWM channel config structure
	_ledc_channel_config = new ledc_channel_config_t;
																												DPRINTLN("  - PWM channel selection :");
		// auto select PWM channel if no pwmChannel is provided prior setup()
	if (_pwmChannel == NOT_SET) {																				DPRINTLN("    -> No PWM channel specified. Auto-selecting a free one.");
		for (uint8_t channel = 0; channel < LEDC_CHANNEL_MAX; channel++)
		{		// use first free channel ...
			if (_pwm_channel_used[channel] == false) {															DPRINT("      -> Channel "); DPRINT(channel); DPRINTLN(" free. Using it for PWM signal.");
				_pwm_channel_used[channel] = true;
				_pwmChannel = channel;
				
				break;
			}
				// ... or exit with error if no one are available
			if (channel == (LEDC_CHANNEL_MAX - 1)) {															DPRINTLN("      -> No suitable free channel available. Abording configuration.");
					// free up memory and exit
				delete _ledc_channel_config;
				
				if (_clients_for_timer[_pwmTimer] == 0) {
					delete _timers_config[_pwmTimer];
				}
				
				return EXIT_FAILURE;
			}
		}
	}
	
	else {																										DPRINT("    -> PWM channel specified by user. Using channel ");DPRINT(_pwmChannel); DPRINTLN(" for this PWM signal");
		// pwm channel set prior attach(). Statement for debug output.
	}
	
		// seeding PWM channel config parameters 
	_ledc_channel_config->channel				= (ledc_channel_t)_pwmChannel;
	_ledc_channel_config->duty					= 0;
	_ledc_channel_config->hpoint				= 0;
	_ledc_channel_config->gpio_num				= pwmPin;
	_ledc_channel_config->speed_mode			= LEDC_HIGH_SPEED_MODE;
	_ledc_channel_config->timer_sel				= (ledc_timer_t)_pwmTimer;
	_ledc_channel_config->intr_type				= LEDC_INTR_DISABLE;
	_ledc_channel_config->flags.output_invert 	= 0;

		// start PWM signal on pwmPin.
	ledc_channel_config(_ledc_channel_config);																	DPRINT("  - Starting PWM signal on pin "); DPRINTLN(pwmPin);
																												DPRINTLN("PWM generator configuration success."); DPRINTLN();
		// register this instance for PWM timer used.
	_clients_for_timer[_pwmTimer]++;
	
		// set ledc fade service on for ledc_set_duty_and_update/ledc_set_fade_time_and_start functions
	ledc_fade_func_install(0);
		
		// set _pwmMaxDuty from duty bit resolution
	_pwmMaxDuty = getMaxDutyVal();
	
		// set direction pin if provided
	if (dirPin != NOT_SET) {
		_dirPin = dirPin;																						DPRINT("DIR pin set to pin"); DPRINTLN(_dirPin);
		pinMode(_dirPin, OUTPUT);
	}

	else {																										DPRINTLN("No DIR pin provided. Motor direction set by pus/minus speed."); DPRINTLN();
		// direction pin not set. Direction set by pus/minus speed.
	}

		// wake up driver if need
	doNotSleep();

	return EXIT_SUCCESS;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	setDirMode(dirMode) - set motor driver dir mode (speed/dir or phase/enable)
/		uint8_t dirMode: dir pin mode (speed/dir or phase/enable)                      */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::setDirMode(uint8_t dirMode)
{
    // Case 1 : No pin set, SPEED_DIR_MOdE set by default
  if (_dirPin == NOT_SET) {
   _dirMode = ESP32_PWM_MOTOR_SPEED_DIR_MODE
;
  return EXIT_SUCCESS; 
  }

  // Case 2 & 3 : Check mode and set _dirMode flag
  if (dirMode == ESP32_PWM_MOTOR_SPEED_DIR_MODE	|| dirMode == ESP32_PWM_MOTOR_PH_EN_MODE) {
    _dirMode = dirMode;
    return EXIT_SUCCESS;
  }

  return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	setBreakPin(breakPin, mode) - set motor driver break pin and its activemode
/		uint8_t breakPin: pin connected to motor driver break pin
/		uint8_t mode: active mode of the break pin                                 */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::setBreakPin(uint8_t breakPin, uint8_t mode)
{																												DPRINTLN("Break pin configuration:");
	if (mode == ESP32_PWM_MOTOR_ACTIVE_LOW || mode == ESP32_PWM_MOTOR_ACTIVE_HIGH) {
		_breakPin = breakPin;																					DPRINT("  Break pin attached to pin "); DPRINTLN(_breakPin);
		_breakPinMode = mode;																					DPRINTLN("  Break pin mode correctly set");
		
		pinMode(_breakPin, OUTPUT);
		
		return EXIT_SUCCESS;
	}
																												DPRINTLN("  Bad break pin mode provided. Configuration aborded");
	return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	setSleepPin(breakPin, mode) - set motor driver sleep pin and its active mode
/		uint8_t breakPin: pin connected to motor driver sleep pin
/		uint8_t mode: active mode of the sleep pin                                 */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::setSleepPin(uint8_t sleepPin, uint8_t mode)
{																												DPRINTLN("Sleep pin configuration:");
	if (mode == ESP32_PWM_MOTOR_ACTIVE_LOW || mode == ESP32_PWM_MOTOR_ACTIVE_HIGH) {
		_sleepPin = sleepPin;																					DPRINT("  Sleep pin attached to pin "); DPRINTLN(_sleepPin);
		_sleepPinMode = mode;																					DPRINTLN("  Sleep pin mode correctly set");
		
