API-rep/Open-Node-RC-Core/lib/ESP32_PWM_Motor/ESP32_PWM_Motor.cpp
		pinMode(_sleepPin, OUTPUT);
		
		return EXIT_SUCCESS;
	}
																												DPRINTLN("  Bad sleep pin mode provided. Configuration aborded");
	return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	MotorMargin(minMargin, maxMargin) - compensate motor dead zone
/		uint8_t minMargin: minimum speed at which the motor start
/		uint8_t maxMargin: maximum motor speed limit (in booth direction)          */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::setMargin(uint8_t minMargin, uint8_t maxMargin)
{																												DPRINTLN("  Setting up minMargin/maxMargin");
	if (minMargin >= MIN_SPEED && maxMargin <= MAX_SPEED && minMargin < maxMargin) {
		_minMargin = minMargin;
		_maxMargin = maxMargin;

			// check if custom margin are set and switc on/off marginAreSet flag
		if (minMargin == MIN_SPEED && maxMargin == MAX_SPEED) {
			_marginAreSet = false;																				DPRINTLN("    -> Min/max Margin set (or reset) to default value.");
		}

		else {
			_marginAreSet = true;																				DPRINTLN("    -> New minMargin/maxMargin set correctly.");
		}

		return EXIT_SUCCESS;
	}
																												DPRINTLN("    -> Bad minMargin and/or maxMargin value provided.");
	return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	runAtSpeed(speed) - set motor speed (PWM duty cycle)
/		float speed: motor speed in % (0-100%)                                     */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::runAtSpeed(float speed)
{																												DPRINTLN("Setting motor speed.");
		// set speed if provide speed is valid
	if (speedIsValid(speed) == EXIT_SUCCESS) {
			// map speed into custom margin if set 
		if (_marginAreSet) {
			speed = speedInMargin(speed);
		}

			// set _dirPin direction (if defined) from speed
		dirPinFromSpeed(speed);

			// compute PWM duty cycle from booth mode (DIR pin or not)
		uint32_t duty = speedToDuty(speed);

		ledc_set_duty_and_update(LEDC_HIGH_SPEED_MODE, (ledc_channel_t)_pwmChannel, duty, 0);

		return EXIT_SUCCESS;
	}
																												DPRINTLN("  Speed setting aborded.");
	return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	accelToSpeed(speed, accel) - set motor speed with acceleration
/		float speed: motor speed in % (0-100%)
/		uint32_t accel: acceleration in ms per speed %                             */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::accelToSpeed(float targetSpeed, uint32_t accel)
{																												DPRINTLN("Setting speed with acceleration.");
		// set speed if provide speed is valid
	if(speedIsValid(targetSpeed) == EXIT_SUCCESS && accelIsValid(accel) == EXIT_SUCCESS) {
			// map speed into custom margin if set 
		if (_marginAreSet) {
			targetSpeed = speedInMargin(targetSpeed);
		}
			// set _dirPin direction (if defined) from speed.
		dirPinFromSpeed(targetSpeed);

			// check acceleration factor to avoid negative value underflow
		uint32_t currentDuty = ledc_get_duty(LEDC_HIGH_SPEED_MODE, (ledc_channel_t)_pwmChannel);				DPRINT("currentDuty is : "); DPRINTLN(currentDuty);
		uint32_t target_duty = speedToDuty(targetSpeed);														DPRINT("target_duty is : "); DPRINTLN(target_duty);
		uint32_t fadeInDuty = 0; 
		
			// speed decrease
		if (max(currentDuty, target_duty) == target_duty) {														DPRINTLN("Increasing speed : ");
			fadeInDuty = target_duty - currentDuty;																DPRINT("fadeInDuty is : "); DPRINTLN(fadeInDuty);
		}
			// speed increase
		else {																									DPRINTLN("Decreasing speed : ");
			fadeInDuty = currentDuty - target_duty;																DPRINT("fadeInDuty is : "); DPRINTLN(fadeInDuty);
		}

		uint32_t max_fade_time_ms = ((fadeInDuty * accel * 100) / _pwmMaxDuty);									DPRINT("max_fade_time_ms is : "); DPRINTLN(max_fade_time_ms);
		ledc_set_fade_time_and_start(LEDC_HIGH_SPEED_MODE, (ledc_channel_t)_pwmChannel, target_duty, max_fade_time_ms, LEDC_FADE_NO_WAIT);

		return EXIT_SUCCESS;
	}
	return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	stop() -  stop motor rotatation                                           */
/////////////////////////////////////////////////////////////////////////////////////
void ESP32_PWM_Motor::stop()
{																												DPRINTLN("Motor stoped.");
	runAtSpeed(MIN_SPEED);
}

/////////////////////////////////////////////////////////////////////////////////////
/*	enable() -  enable motor driver power                                          */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::enable() 
{
      // phase/enable mode, set dirPin HIGH
    if (_dirPin != NOT_SET) {
      digitalWrite(_dirPin, HIGH);
      return EXIT_SUCCESS;
    }

	return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	enable() -  disable motor driver power                                         */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::disable()
{
      // phase/enable mode, set dirPin HIGH
    if (_dirPin != NOT_SET) {
      digitalWrite(_dirPin, LOW);
      return EXIT_SUCCESS;
    }

	return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	doBreak() - enable motor driver break mode                                     */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::doBreak()
{	
	if (_breakPin != NOT_SET) {																					DPRINTLN("Motor driver break mode enable");
			// set break pin direction in regard of break pin mode
		if (_breakPinMode == ESP32_PWM_MOTOR_ACTIVE_LOW) {
			digitalWrite(_breakPin, LOW);
		}

		else {
			digitalWrite(_breakPin, HIGH);
		}
		
