API-rep/Open-Node-RC-Core/lib/ESP32_PWM_Motor/ESP32_PWM_Motor.cpp
		return EXIT_SUCCESS;
	}
																												DPRINT("Break mode configuation aborded. No break pin configured.");
	return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	doNotBreak()() - disable motor driver break mode                               */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::doNotBreak()
{	
	if (_breakPin != NOT_SET) {																					DPRINTLN("Motor driver break mode disable");
			// set break pin direction in regard of break pin mode
		if (_breakPinMode == ESP32_PWM_MOTOR_ACTIVE_LOW) {
			digitalWrite(_breakPin, HIGH);
		}

		else {
			digitalWrite(_breakPin, LOW);
		}
		
		return EXIT_SUCCESS;
	}
																													DPRINT("Break mode configuation aborded. No break pin configured.");
	return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	sleep() - put motor driver into sleep mode                                     */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::sleep()
{	
	if (_sleepPin != NOT_SET) {																					DPRINTLN("Motor driver put into sleep mode");
			// set sleep pin direction in regard of sleep pin mode
		if (_sleepPinMode == ESP32_PWM_MOTOR_ACTIVE_LOW) {
			digitalWrite(_sleepPin, LOW);
		}

		else {
			digitalWrite(_sleepPin, HIGH);
		}
		
		return EXIT_SUCCESS;
	}
																												DPRINTLN("Sleep mode configuation aborded. No sleep pin configured.");
	return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	doNotSleep()() - put motor driver into active mode                             */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::doNotSleep()
{	
	if (_sleepPin != NOT_SET) {																					DPRINTLN("Motor driver put into active mode");
			// set sleep pin direction in regard of sleep pin mode
		if (_sleepPinMode == ESP32_PWM_MOTOR_ACTIVE_LOW) {
			digitalWrite(_sleepPin, HIGH);
		}

		else {
			digitalWrite(_sleepPin, LOW);
		}
		
		return EXIT_SUCCESS;
	}
																												DPRINTLN("Wakeup aborded. No sleep pin configured.");
	return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	wakeup()() - wakeup motor driver from sleep mode                               */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::wakeup()
{	
	return doNotSleep();
}

/////////////////////////////////////////////////////////////////////////////////////
/*	getSpeed() - Return the current speed with direction (+ for CW, - for CCW)     */
/////////////////////////////////////////////////////////////////////////////////////
float ESP32_PWM_Motor::getSpeed()
{		// get duty cycle from ledc
	float speed = dutyToSpeed(ledc_get_duty(_timers_config[_pwmTimer]->speed_mode, _ledc_channel_config->channel));
//	uint32_t duty = ledc_get_duty(_timers_config[_pwmTimer]->speed_mode, _ledc_channel_config->channel);
																												DPRINT("getSpeed() : raw speed from ledc duty cycle : "); DPRINTLN(speed);
		// revert speed if mapped into margin 
	if (_marginAreSet) {
		Serial.print("Speed not reverted : "); Serial.println(speed);
		speed = revertMargedSpeed(speed);
		Serial.print("Speed reverted : "); Serial.println(speed);
	}

		// return [-100,100] speed for "no dirPin" mode, [0,100] for CW direction "dirPin" mode 
	if ((_dirPin == NOT_SET) || (digitalRead(_dirPin) == CLOCKWISE)) {
		return speed;			
	}
		// else, return [-100,0] speed for CCW direction in "dirPin" mode 
	return -speed;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	isMoving() - return true if motor is moving                                    */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::isMoving()
{		// check current speed (acceleration mode) or target speed (simple mode)
	if (getSpeed() != MIN_SPEED) {
		return true;
	}
		// not moving
	return false;

}

/////////////////////////////////////////////////////////////////////////////////////
/*	isBreaking() - check if motor driver is in breaking mode                       */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::isBreaking()
{		// check if motor driver is in break mode ...
	if (((digitalRead(_breakPin) == 1) && (_breakPinMode == ESP32_PWM_MOTOR_ACTIVE_HIGH)) || 
	    ((digitalRead(_breakPin) == 0) && (_breakPinMode == ESP32_PWM_MOTOR_ACTIVE_LOW))) {

		return true;
	}
		// ... or not.
	return false;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	isSleeping() - check if motor driver is in sleep mode                          */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::isSleeping()
{		// check if motor driver is in sleep mode ...
	if (((digitalRead(_sleepPin) == 1) && (_sleepPinMode == ESP32_PWM_MOTOR_ACTIVE_HIGH)) || 
	    ((digitalRead(_sleepPin) == 0) && (_sleepPinMode == ESP32_PWM_MOTOR_ACTIVE_LOW))) {

		return true;
	}
		// ... or not.
	return false;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	getPwmTimer() - Return the PWM timer (0-3) use by PWM signal or -1 if not set  */
/////////////////////////////////////////////////////////////////////////////////////
int8_t ESP32_PWM_Motor::getPwmTimer()
{		// check if PWM is configured and return timer ...
	if (_ledc_channel_config != NULL) {

		return _ledc_channel_config->timer_sel;
	}
		// ... or return NOT_SET if not configured
	return NOT_SET;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	getPwmFreq() - Return the frequency of the PWM signal                          */
/////////////////////////////////////////////////////////////////////////////////////
uint32_t ESP32_PWM_Motor::getPwmFreq()
{		// check if PWM is configured and return frequency ...
	if (_ledc_channel_config != NULL) {
		return ledc_get_freq(LEDC_HIGH_SPEED_MODE, (ledc_timer_t)_pwmTimer);
	}
		// ... or error code if not configured
	return -1;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	getMaxDutyVal() - Return the maximum value of PWM duty cycle                   */
/////////////////////////////////////////////////////////////////////////////////////
uint32_t ESP32_PWM_Motor::getMaxDutyVal()
{		// check if PWM is configured and return frequency ...
	if (_ledc_channel_config != NULL) {
		uint8_t duty_resolution = _timers_config[_pwmTimer]->duty_resolution;
		
		return (pow(2,duty_resolution) - 1);
	}
		// ... or return error code if not configured
	return -1;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	accelIsValid(accel) - check if motor acceleration in valid
/		uint32_t accel: acceleration factor in ms per speed %                      */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::accelIsValid(uint32_t accel)
{																												DPRINTLN("  Checking acceleration factor");
	uint32_t uint32MaxVal = -1;
		// test if (accel x _pwmMaxDuty x 100) don't overflow uint32_t max value
	if ((_pwmMaxDuty * accel * 100) < uint32MaxVal) {
		return EXIT_SUCCESS;
	}
																												DPRINT("    Acceleration factor to big. Try with a value lower than "); DPRINTLN(uint32MaxVal / (100 * _pwmMaxDuty));
	return EXIT_FAILURE;

