API-rep/Open-Node-RC-Core/lib/ESP32_PWM_Motor/ESP32_PWM_Motor.cpp
}

/////////////////////////////////////////////////////////////////////////////////////
/*	speedIsValid(speed) - check if abs speed is in -MAX_SPEED <-> MAX_SPEED range
		float speed :  motor speed in %                                            */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::speedIsValid(float speed)	
{		// check if speed value is in MIN_SPEED <-> +/-MAX_SPEED range
	if (speed == constrain(speed, -MAX_SPEED, MAX_SPEED)) { 													DPRINTLN("  Checking speed value.");
		return EXIT_SUCCESS;
	}
																												DPRINTLN("    Invalid speed value.");
	return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	speedToDuty(speed) - convert speed to duty value
		float speed :  motor speed in %                                            */
/////////////////////////////////////////////////////////////////////////////////////
uint32_t ESP32_PWM_Motor::speedToDuty(float speed)
{
	if (_dirMode == ESP32_PWM_MOTOR_PH_EN_MODE) {
			// dir pin not set, duty set in 0 <- 50(neutral) -> 100% range
			DPRINT("  No dir speed convert to duty value "); DPRINT(round(_pwmMaxDuty * ((speed + MAX_SPEED) / (MAX_SPEED * 2))));
		return round(_pwmMaxDuty * ((speed + MAX_SPEED) / (MAX_SPEED * 2)));
	}

	else {
			// dir pin set, duty set in 0 <-> 100% range
				DPRINT("  Dir Speed convert to duty value "); DPRINTLN(round(_pwmMaxDuty * (abs(speed) / MAX_SPEED))); 
		return round(_pwmMaxDuty * (abs(speed) / MAX_SPEED));
	}
}

/////////////////////////////////////////////////////////////////////////////////////
/*	dutyToSpeed(duty) - convert duty cycle to speed
		uint32_t duty :  duty cycle                                                */
/////////////////////////////////////////////////////////////////////////////////////
float ESP32_PWM_Motor::dutyToSpeed(uint32_t duty)
{
	if (_dirPin == NOT_SET) {
			// dir pin not set, speed retuned set in 0 <-> 100% range
		return ((((((float) duty * 2) - _pwmMaxDuty) / _pwmMaxDuty) * MAX_SPEED));
	}
	
	else {
			// dir pin set, speed retuned in -100% <-> 100% range
		return ((((float) duty / _pwmMaxDuty) * MAX_SPEED));
	}
}

/////////////////////////////////////////////////////////////////////////////////////
/*	speedInMargin(speed) - map provide speed into min/max margin range. 
                           zero is not mapped and is retunned unchanged.
		float speed :  speed to convert                                            */
/////////////////////////////////////////////////////////////////////////////////////
float ESP32_PWM_Motor::speedInMargin(float speed)
{		// zero value exception
	if (speed == 0) {																							DPRINTLN("  Zero value returned as it.");
		return 0.0;
	}	
		// map positive speed value into margin ...	
	else if (speed >= 0) {																						DPRINTLN("  Positive speed value mapped to ");
		return ((speed * (((float)(_maxMargin - _minMargin)) / 100)) + _minMargin);
	}
		// ... or negative one (sign is keeped)
	else {																										DPRINTLN("  Negative speed value mapped to ");
		return ((speed * (((float)(_maxMargin - _minMargin)) / 100)) - _minMargin);
	}
}

/////////////////////////////////////////////////////////////////////////////////////
/*	revertMargedSpeed(speed) - rool back marged speed to base speed .
                               zero is not mapped and is retunned unchanged.
		float speed :  speed to convert                                            */
/////////////////////////////////////////////////////////////////////////////////////
float ESP32_PWM_Motor::revertMargedSpeed(float speed)
{		// zero value exception
	if (speed == 0) {																							DPRINTLN("  Zero value returned as it.");
		return 0.0;
	}	
		// map positive speed value into margin ...	
	else if (speed >= 0) {																						DPRINTLN("  Positive speed value reverted");
//		return ((speed * (((float)(_maxMargin - _minMargin)) / 100)) + _minMargin);
		return ((speed - _minMargin) / (((float)(_maxMargin - _minMargin)) / 100));
	}
		// ... or negative one (sign is keeped)
	else {																										DPRINTLN("  Negative speed value reverted to ");
//		return ((speed / (((float)(_maxMargin - _minMargin)) / 100)) + _minMargin);
		return ((speed + _minMargin) / (((float)(_maxMargin - _minMargin)) / 100));
	}
}

/////////////////////////////////////////////////////////////////////////////////////
/*	dirPinFromSpeed() - set dirPin direction from speed value for speed/dir mode   */
/////////////////////////////////////////////////////////////////////////////////////
bool ESP32_PWM_Motor::dirPinFromSpeed(float speed)
{		// set direction pin if defined
	if ((_dirPin != NOT_SET) && (_dirMode == ESP32_PWM_MOTOR_SPEED_DIR_MODE)) {
			// clockwise for positive and zero speed value
		if (speed >= 0) {
			digitalWrite(_dirPin, CLOCKWISE);																	DPRINTLN("Direction pin direction set clockwise");
		}
			// counterclockwise for negative speed value
		else {
			digitalWrite(_dirPin, COUNTERCLOCWISE);																DPRINTLN("Direction pin direction set counterclockwise");
		}

		return EXIT_SUCCESS;
	}
																												DPRINTLN("No direction pin defined or function not available for current dir mode.");
	return EXIT_FAILURE;
}

/////////////////////////////////////////////////////////////////////////////////////
/*	espSilentLog(...) - read number of character write durring esp_log msg
										                                           */
/////////////////////////////////////////////////////////////////////////////////////
int ESP32_PWM_Motor::espSilentLog(const char* string, va_list args)
{		// store number of character into "string"
	_logHasOccure = vsnprintf(NULL, 0, string, args);

	return vprintf("coucou", args);
}


/* destructor:
	-> delete (free) *ledc_channel_config memory AND set _pwm_channel_used[channel] = false
	-> _clients_for_timer[_pwmTimer]--;
	-> delete (free) *_timers_config[_pwmTimer] SI _clients_for_timer[_pwmTimer] == 0
	-> _default_timer = NOT_SET SI _default_timer != NOT_SET ET _clients_for_timer[_default_timer] == 0
*/